Public Member Functions | Public Attributes | List of all members
API_ElemPartId Struct Reference
Element Manager API
Identify a part of an element. It's valid for PolyRoof and Morph only. More...
#include <APIdefs_Elements.h>
 Public Member Functions
API_ElemPartId ()
bool  | operator== (const API_ElemPartId &right) const
bool  | operator!= (const API_ElemPartId &right) const
ULong  | GenerateHashValue () const
 Public Attributes
UInt32  | main
UInt32  | sub
Int32  | floor
Detailed Description
Identify a part of an element. It's valid for PolyRoof and Morph only.
Constructor & Destructor Documentation
◆ API_ElemPartId()
 API_ElemPartId::API_ElemPartId  |  ( |   | )
inline
Member Function Documentation
◆ GenerateHashValue()
 ULong API_ElemPartId::GenerateHashValue  |  ( |   | ) |   const
inline
◆ operator!=()
 bool API_ElemPartId::operator!=  |  ( |  const API_ElemPartId &  |  right | ) |   const
inline
◆ operator==()
 bool API_ElemPartId::operator==  |  ( |  const API_ElemPartId &  |  right | ) |   const
inline
Member Data Documentation
◆ floor
 Int32 API_ElemPartId::floor
◆ main
 UInt32 API_ElemPartId::main
◆ sub
 UInt32 API_ElemPartId::sub